[LANG]
language=Malay (Malaysia)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Kesalahan sintaks SQL
200002=Fail tidak wujud
200003=Fail rosak
200004=Kesalahan parameter
200026=Nama jadual sudah wujud
200027=Nama jadual tidak wujud
200028=Ralat import fail CSV, gagal menjana SQL, sila periksa kandungan fail CSV dan konfigurasi
300001=Tiada lajur jadual dipilih untuk cipta indeks
300002=Penyata SQL tidak boleh kosong
300003=Analisis SQL hanya menyokong pertanyaan SELECT
[STRING]
home=Laman Utama
database=Pangkalan Data
analysis=Analisis
view=Paparan
setting=Tetapan
items=rekod
tables=Jadual Data
views=Paparan
triggers=Pencetus
columns=Lajur
indexes=Indeks
table=Jadual
clear-all=Kosongkan Semua
yes=Ya
no=Tidak
welcome-text=Selamat Datang ke CuteSqlite
home-text1=CuteSqlite ialah alat klien grafik (GUI) untuk Sqlite3.
home-text2=Ia membolehkan anda mereka bentuk, mencipta dan menyemak imbas pangkalan data, mengurus objek pangkalan data,
home-text3=dan memasukkan data serta mereka bentuk dan menjalankan pertanyaan SQL untuk memproses data yang disimpan.
home-text4=Anda juga boleh memindahkan pangkalan data dan data daripada vendor pangkalan data lain ke pangkalan data Sqlite.
db-section-text=Pangkalan Data Sqlite
analysis-text1=CuteSqlite membolehkan anda menganalisis dan mengoptimumkan prestasi penyata SQL.
analysis-text2=Ia juga membolehkan anda menganalisis kapasiti storan setiap jadual dalam pangkalan data,
analysis-text3=serta mengkonfigurasi parameter pangkalan data untuk mengoptimumkannya.
perf-analysis-section-text=Analisis Prestasi
error-text=Ralat Sistem:
create-database=Cipta Pangkalan Data Baharu (Ctrl+N)
open-database=Buka Pangkalan Data (Ctrl+O)
refresh-database=Muat Semula Pangkalan Data (F5)
delete-database=Alih Keluar Pangkalan Data Terpilih daripada Senarai (Del)
override-user-db=Data fail yang dipadam tidak dapat dipulihkan. Pastikan untuk ganti pangkalan data?
create-db-success-text=Pangkalan data berjaya dicipta
open-db-exists-inlist=Pangkalan data sudah dibuka, sila jangan ulangi operasi
open-db-success-text=Pangkalan data berjaya dibuka
delete-user-db=Pastikan untuk mengalih keluar pangkalan data "{dbName}" daripada senarai?
delete-db-success-text=Pangkalan data berjaya dialih keluar daripada senarai
query-editor=Editor Pertanyaan
history=Sejarah
history-tip=Sejarah (F8)
result-list=Keputusan
result-info=Maklumat
result-table-data=Data Jadual
table-properties=Sifat Jadual
exec-select-sql=Jalankan Pertanyaan Terpilih (F9)
exec-all-sql=Jalankan Semua Pertanyaan (F10)
explain-select-sql=Terangkan (Explain) Penyata SQL Terpilih (F11)
explain-query-plan-sql=Terangkan Pelan Pertanyaan (Explain Query Plan) Penyata SQL Terpilih (F12)
query-page-help=Fungsi auto-lengkap: [Tab]->tab seterusnya; [Ctrl+Space]->Senarai padanan; [Ctrl+Enter]->Senarai semua tag
no-select-userdb=Tiada pangkalan data dipilih
no-sql-statement=Editor pertanyaan tiada penyata SQL
no-sql-content=Editor pertanyaan tiada kandungan SQL
show-form-view=Papar Paparan Borang
export-result-as=Eksport sebagai... (Ctrl+Alt+E)
copy-result-data=Salin Data ke Papan Klip
clear-all=Kosongkan Semua
ok=OK
cancel=Batal
export-text-description=Pilih format untuk eksport data
csv-settings=Pilihan CSV
csv-field-settings=Lajur
csv-line-settings=Baris
csv-charset-setting=Kod Aksara
excel-settings=Pilihan Excel
sql-settings=Pilihan SQL
export-fields-settings=Pilih Lajur untuk Dieksport
terminated-by=Pemisah
enclosed-by=Penyertakan
escaped-by=Pelarian
field-terminated-by=Pemisah Lajur
field-enclosed-by=Penyertakan Lajur
field-escaped-by=Pelarian Lajur
line-terminated-by=Pemisah Baris
add-column-name=Tambah Nama Lajur di Kepala
csv-charset=Kod Aksara
excel-column-max-size-size=Had Saiz Lajur Teks
excel-decinmal-places=Tempat Perpuluhan
structure-only=Struktur Sahaja
data-only=Data Sahaja
structure-and-data=Struktur dan Data
select-all=Pilih Semua
deselect-all=Nyahpilih Semua
save-to-file=Simpan ke Fail
expert-fmt-error=Sila pilih format fail untuk eksport data
terminated-by-error=Sila masukkan nilai untuk "Pemisah"
enclosed-by-error=Sila masukkan nilai untuk "Penyertakan"
escaped-by-error=Sila masukkan nilai untuk "Pelarian"
line-terminated-by-error=Nilai "Pemisah Baris" tidak sah
excel-column-max-size-error=Sila masukkan nilai untuk "Had Saiz Lajur Teks"
excel-decinmal-places-error=Sila masukkan nilai untuk "Tempat Perpuluhan"
export-sql-error=Sila pilih pilihan SQL
selected-fields-error=Sila pilih lajur untuk dieksport
export-path-error=Sila masukkan laluan fail eksport
sql-notsupport-multitable-query-error=Eksport keputusan pertanyaan berbilang jadual dan subkueri tidak disokong
export-success-text=Eksport berjaya, {rows} baris data telah dieksport. Buka fail?
open-the-file=Buka Fail
export-file-exists-prompt={export-path} sudah wujud. Ganti?
limit-rows=Had Baris
offset=Baris Mula
rows=Baris
copy-all-rows-to-clipboard=Salin Semua Baris ke Papan Klip	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Salin Baris Terpilih ke Papan Klip	Ctrl+Alt+H
copy-all-rows-as-sql=Salin Semua Baris sebagai SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Salin Baris Terpilih sebagai SQL	Ctrl+Alt+K
read-only=Hanya Baca
filter=Penapis (Ctrl+Alt+F)
filter-in-use=Penapis Sedang Digunakan
refresh=Muat Semula (Ctrl+F5)
refresh-page=Muat Semula
new-row-tip=Baris Baharu (Ctrl+Alt+N)
copy-row-tip=Salin Baris (Ctrl+Alt+C)
save-tip=Simpan (Ctrl+Alt+S)
delete-tip=Padam Baris Terpilih (Ctrl+Del)
cancel-tip=Asal Semula Perubahan (Ctrl+Alt+Z)
revert-tip=Pulihkan
save=Simpan
revert=Asal Semula Perubahan
column=Nama Lajur
condition=Syarat
value=Nilai
delete-confirm-text=Pastikan untuk memadam baris yang dipilih?
query=Pertanyaan
result=Keputusan
affected-rows=Baris Terjejas
exec-time=Masa Laksana
transfer-time=Masa Pindah
total-time=Jumlah Masa
database-create=Cipta Pangkalan Data		Ctrl+N
database-open=Buka Pangkalan Data		Ctrl+O
database-refresh=Muat Semula Pangkalan Data		Ctrl+R
database-delete=Padam Pangkalan Data		Del
database-copy=Salin Pangkalan Data sebagai...	Ctrl+P
database-export-as-sql=Eksport Pangkalan Data ke SQL	Ctrl+E
database-import-from-sql=Import SQL ke Pangkalan Data	Ctrl+I
database-new=Cipta
database-new-table=Jadual
database-new-view=Paparan
database-new-trigger=Pencetus
export-as-sql-text-description=Eksport jadual/paparan/pencetus pangkalan data terpilih sebagai SQL
select-database=Pangkalan Data Terpilih
database-objects=Objek
structure-and-data-settings=Tetapan Struktur dan Data
insert-statement-settings=Tetapan Penyata INSERT
tbl-statement-settings=Tetapan Penyata Jadual
retain-column-text=Kekalkan Nama Lajur dalam "Insert Into"
contain-multi-rows-text=Setiap Penyata "Insert" Mengandungi Berbilang Baris (VALUES)
retain-table-text=Kekalkan Jadual Lama (Create Table If Not Exists ...)
override-table-text=Ganti Jadual Lama (DROP TABLE, kemudian CREATE TABLE)
import-from-sql-text-description=Laksana penyata dalam fail SQL secara kelompok.
abort-on-error-text=Berhenti jika ralat.
import-file-not-exists=Fail SQL yang diimport tidak wujud, sila pilih semula.
import-path-empty-error=Laluan fail import tidak boleh kosong.
import=Import
export=Eksport
tbl-name=Nama Jadual
new-table=Cipta Jadual
new-view=Cipta Paparan
new-trigger=Cipta Pencetus
database=Pangkalan Data
schema=Skema
table-columns=Lajur
table-indexes=Indeks
table-foreignkeys=Kunci Asing
column-name=Nama Lajur
data-type=Jenis Data
default=Asal
check=Semak
index-name=Nama Indeks
index-type=Jenis Indeks
index-unique=Unik
partial-clause=Klausa Separa
comments=Ulasan
to-be-selected=Lajur untuk Dipilih
selected=Terpilih
up=▲
down=▼
no-columns-selected=Tiada lajur dipilih, sila pilih
sql-preview=Pralihat SQL
tbl-name-empty=Nama jadual tidak boleh kosong
tbl-name-duplicated=Nama jadual sudah wujud
create-table-success-text=Jadual berjaya dicipta.
alter-table-success-text=Jadual berjaya diubah suai.
rename-table-success-text=Nama jadual berjaya diubah.
delete-column-confirm-text=Lajur terpilih dirujuk oleh satu atau lebih indeks. Memadam lajur ini juga akan mengubah suai indeks berkaitan. Pastikan untuk teruskan pemadaman?
delete-index-confirm-text=Indeks terpilih dirujuk oleh satu atau lebih lajur. Memadam indeks ini juga akan mengubah suai lajur berkaitan. Pastikan untuk teruskan pemadaman?
delete-confirm-text=Pastikan untuk teruskan pemadaman?
new-view=Cipta Paparan
new-trigger=Cipta Pencetus
create-a-view-name=Nama Paparan Baharu
view-name-not-empty=Nama paparan baharu tidak boleh kosong
view-name-duplicated=Nama paparan sudah wujud
create-a-trigger-name=Nama Pencetus
trigger-name-not-empty=Nama pencetus tidak boleh kosong
trigger-name-duplicated=Nama pencetus sudah wujud
execute-sql-success=SQL berjaya dilaksana
copy-db-success-text=Salinan pangkalan data berjaya
table-open=Buka Data Jadual		Alt+O
table-create=Cipta Jadual		Alt+N
table-alter=Ubah Suai Jadual		Alt+A
table-rename=Tukar Nama Jadual		Alt+M
table-truncate=Kosongkan Jadual		Alt+T
table-drop=Padam Jadual		Alt+Del
table-copy-as=Salin Jadual ke...		Alt+P
table-sharding-as=Serpihan Data		Alt+G
table-export=Eksport Jadual ke...	Alt+E
table-import-sql=Import dari Fail SQL	Alt+I
table-import-csv=Import dari Fail CSV	Alt+J
table-manage-index=Urus Indeks Jadual
table-manage-foreign-key=Urus Kunci Asing Jadual
properties=Sifat
primary-key-duplicated=Kunci Utama (Primary Key) ditakrif berulang.
foreignkey-name=Nama Kunci Asing
referencing-columns=Lajur Jadual Ini
referenced-table=Jadual Rujukan
referenced-columns=Lajur Rujukan
on-update=Semasa Kemas Kini
on-delete=Semasa Padam
insert-new-column=Tambah Lajur Baharu
insert-new-index=Tambah Indeks Baharu
insert-new-foreignkey=Tambah Kunci Asing Baharu
insert-del-column=Padam Lajur Terpilih
insert-del-index=Padam Indeks Terpilih
insert-del-foreignkey=Padam Kunci Asing Terpilih
select-referenced-table-first=Sila pilih jadual rujukan terlebih dahulu
new-table-name=Nama Jadual Baharu
table-name-not-empty=Nama jadual baharu tidak boleh kosong
table-name-duplicated=Nama jadual baharu sudah wujud
ai-column-exists=Lajur Auto-Increment (AUTOINCREMENT) sudah wujud.
ai-fobidden-multi-pk=Lajur Auto-Increment (AUTOINCREMENT) sudah wujud, berbilang lajur kunci utama tidak dibenarkan.
ai-column-must-integer=Lajur Auto-Increment (AUTOINCREMENT) mestilah jenis INTEGER.
truncate-table-confirm-text=Selepas mengosongkan jadual, data tidak boleh dipulihkan. Pastikan untuk mengosongkan?
truncate-table-success-text=Jadual data berjaya dikosongkan
drop-table-confirm-text=Selepas memadam jadual data, data tidak boleh dipulihkan. Pastikan untuk memadam?
drop-table-success-text=Jadual data berjaya dipadamkan
copy-table-text-description=Konfigurasi parameter salinan, menyokong serpihan data jadual
from-db-name=Pangkalan Data Sumber
from-tbl-name=Jadual Sumber
to-db-name=Pangkalan Data Sasaran
to-tbl-name=Jadual Sasaran
table-sharding-setttings=Serpihan Data Jadual
enable-table-sharding=Aktifkan Serpihan Data Jadual
table-suffix-begin={suffix} Integer Mula
table-suffix-end={suffix} Integer Tamat
advanced-settings=Pilihan Lanjutan Serpihan Jadual
enable-copy-data-with-strategy=Aktifkan strategi untuk menyalin data ke jadual serpihan
sharding-strategy-express-text=Ekspresi Strategi Serpihan: {n}
preview-sql=Pralihat Penyata SQL
structure-and-data-settings-unknown=Tetapan Struktur dan Data tidak dipilih
table-suffix-error=Integer serpihan tidak sah, sila masukkan nilai yang betul
target-table-name-no-n=Jadual sasaran mesti mengandungi rentetan "{n}".
sharding-strategy-express-empty=Ekspresi strategi serpihan tidak boleh kosong
copy-table-success-text=Salinan jadual berjaya.
start=Mula
complete=Selesai
express-title=Ekspresi Strategi Serpihan Jadual
functions=Fungsi
express-editor-help=Ekspresi - Klik dua kali fungsi atau lajur untuk masukkan ke editor
import-from-csv-text-description=Konfigurasi untuk import data daripada fail CSV
source-csv-file=Laluan Fail CSV Sumber
target-database=Pangkalan Data Sasaran
target-table=Jadual Sasaran
columns-setttings=Lajur
csv-data=Data CSV
column-name-on-top=Baris pertama sebagai nama lajur
line-terminated-by=Pemisah Baris
csv-null-as-keyword=null/NULL sebagai Kata Kunci SQL
encoding=Kod Aksara
import-success-text=Import Berjaya
incorrect-sql-statement=Penyata SQL tidak betul
import-error-text=Ralat Import
table-manage-columns=Urus Lajur
table-drop-column=Padam Lajur
table-manage-indexes=Urus Indeks
table-drop-index=Padam Indeks
create-view=Cipta Paparan Baharu
open-view=Buka Paparan
drop-view=Padam Paparan
create-trigger=Cipta Pencetus
open-trigger=Buka Pencetus
drop-trigger=Padam Pencetus
drop-view-confirm-text=Selepas memadam paparan, paparan tidak boleh dipulihkan. Pastikan untuk memadam?
drop-view-success-text=Paparan berjaya dipadam
drop-trigger-confirm-text=Selepas memadam pencetus, pencetus tidak boleh dipulihkan. Pastikan untuk memadam?
drop-trigger-success-text=Pencetus berjaya dipadam
sql-templates=Templat Penyata SQL
pragma-templates=Pragmas
sql-log=Log Sejarah SQL
clear-all=Kosongkan Semua
use=Guna
explain=Terangkan (Explain)
top=Semat
untop=Nyahsemat
copy=Salin
delete=Padam
today=Hari Ini
yestoday=Semalam
delete-sql-log-confirm-text=Anda pasti mahu memadam log SQL?
copy-to-clipboard=Telah disalin ke papan klip
save-success-text=Simpan berjaya
delete-success-text=Padam berjaya
data-has-changed=Data telah berubah. Anda pasti mahu tutup halaman?
not-save-and-close=Jangan Simpan, Tutup
cancel=Batal Tutup
table-export-as=Eksport Jadual Data	Alt+E
export-as-sql-success-text=Eksport berjaya. Buka fail?
new-query=Tetingkap Pertanyaan Baharu (F7)
save-current=Simpan Semasa (Ctrl+S)
save-all=Simpan Semua (Ctrl+Shift+S)
first-page=Laman Pertama
prev-page=Laman Sebelumnya
next-page=Laman Seterusnya
last-page=Laman Terakhir
save-if-data-has-changed=Data telah berubah. Pastikan untuk menyimpan dahulu?
unsort=Asal Semula Susunan
tab-close-this=Tutup Ini
tab-close-others=Tutup Selain Ini
tab-close-left=Tutup Semua di Sebelah Kiri
tab-close-right=Tutup Semua di Sebelah Kanan
perf-analysis=Analisis Prestasi
perf-analysis-reports=Laporan Analisis
store-analysis=Analisis Storan
db-params=Parameter Pangkalan Data
not-select-sql=Hanya menyokong penyata SELECT
open-sql-log=Buka Log SQL untuk analisis prestasi (Ctrl+L)
add-sql-analysis=Masukkan penyata SQL untuk analisis prestasi (Ctrl+I)
sql-log-not-found=Log SQL tidak dijumpai, sila periksa sama ada telah dipadam
original-sql=Penyata SQL Asal
where-clause-analysis=Analisis Klausa WHERE
order-clause-analysis=Analisis Klausa ORDER
covering-index-analysis=Analisis Indeks Liputan
table-join-analysis=Analisis Joins
in-table=Jadual Data
where-use-column=Klausa WHERE menggunakan lajur
order-use-column=Klausa ORDER menggunakan lajur
covering-index-column=Klausa WHERE dan ORDER menggunakan lajur
where-use-index=Klausa WHERE menggunakan indeks
order-use-index=Klausa ORDER menggunakan indeks
use-covering-index=Menggunakan indeks liputan
create-index-for-performance=Cadangan: Cipta indeks untuk lajur berikut bagi meningkatkan prestasi pertanyaan
hint-index-for-performance=Petunjuk: Indeks {hintIndexName} telah meliputi lajur: {hintIndexColumns}
create-covering-index-for-performance=Cadangan: Cipta indeks liputan untuk lajur berikut bagi meningkatkan prestasi pertanyaan
create-index-togeger=Cipta Indeks (Bersama)
create-index-individ=Cipta Indeks (Berasingan)
create-covering-index=Cipta Indeks Liputan
explain-query-plan=Terangkan Pelan Pertanyaan (Explain Query Plan)
query-optimizer-pseudocode=Pseudokod berikut menunjukkan proses pelaksanaan pengoptimum pertanyaan
cycle-count=Statistik Kitaran
optimize-cycle-count=Petunjuk: Menukar susunan penyambungan jadual JOIN yang berbeza boleh mengoptimumkan dan mengurangkan bilangan kitaran.
general-settings=Tetapan Umum
about=Perihal
language-setting=Tetapan Bahasa Antara Muka
change-language-restart-text=Menukar bahasa memerlukan perisian ini dimulakan semula.
close-and-restart=Tutup & Mulakan Semula
do-not-restart=Jangan Mulakan Semula
about-us=Perihal Kami
about-us-description=CuteSqlite ialah perisian sumber terbuka yang dibangunkan oleh pengarang Xuehan Qin.
version-info=Versi
version-info-description=CuteSqlite v0.2.2 beta (64-bit)
feedback=Maklum Balas
feedback-description=Jika anda mempunyai isu perisian, atau mempunyai idea dan cadangan untuk aplikasi ini, sila isi borang di bawah untuk maklum balas kepada kami.
content-text=Kandungan
license=Lesen Apache Versi 2.0
select-columns-analysis=Analisis Lajur SELECT
select-use-column=Penyata SELECT menggunakan lajur berikut
select-use-column-count=Bilangan Lajur
select-use-column-advice=Cadangan: Penyata SELECT memilih lebih daripada {maxColumns} lajur. Kurangkan lajur untuk meningkatkan prestasi pertanyaan.
select-use-column-tips=Petunjuk: Kurangkan lajur untuk meningkatkan prestasi pertanyaan.
sql-perf-report-prefix=laporan-prestasi-sql-
store-analysis-prefix=Analisis Storan:
analysis-sql=Analisis SQL
open-perf-report=Buka Laporan		Alt+O
drop-perf-report=Padam Laporan		Alt+Del
drop-perf-report-confirm-text=Pastikan untuk memadam laporan?
store-analysis-text=Membolehkan anda menganalisis kapasiti storan pangkalan data, jadual data, indeks jadual
table-store-analysis=Jadual - {tblName}
index-store-analysis=Indeks - {idxName} - Kepunyaan Jadual:{tblName}
db-disk-used-title=Laporan Penggunaan Ruang Cakera, Laluan DB:{dbPath}
page-size-text=Saiz Halaman (unit: bait)
page-size-tips=Saiz Halaman (unit: bait)
file-bytes-text=Saiz Fail (unit: bait)
file-bytes-tips=Saiz Fail (unit: bait)
file-pgcnt-text=Bilangan halaman dalam keseluruhan fail (nilai ukuran)
file-pgcnt-tips=Bilangan halaman dalam keseluruhan fail (nilai ukuran)
file-pgcnt2-text=Bilangan halaman dalam keseluruhan fail (nilai kiraan)
file-pgcnt2-tips=Bilangan halaman dalam keseluruhan fail (nilai kiraan)
inuse-pgcnt-text=Bilangan halaman yang menyimpan data (telah digunakan)
inuse-pgcnt-tips=Bilangan halaman yang menyimpan data (telah digunakan)
free-pgcnt2-text=Bilangan halaman tanpa data (setiap kepala)
free-pgcnt2-tips=Bilangan halaman tanpa data (setiap kepala)
free-pgcnt-text=Bilangan halaman tanpa data (nilai kiraan)
free-pgcnt-tips=Bilangan halaman tanpa data (nilai kiraan)
av-pgcnt-text=Bilangan halaman yang dikosongkan automatik
av-pgcnt-tips=Bilangan halaman yang dikosongkan automatik
ntable-text=Bilangan jadual dalam pangkalan data
ntable-tips=Bilangan jadual dalam pangkalan data
nindex-text=Bilangan indeks
nindex-tips=Bilangan indeks
nmanindex-text=Bilangan indeks ditakrif
nmanindex-tips=Bilangan indeks ditakrif
nautoindex-text=Bilangan indeks tersirat (indeks auto-inkremen)
nautoindex-tips=Bilangan indeks tersirat (indeks auto-inkremen)
user-payload-text=Bilangan bait muatan pengguna yang disimpan
user-payload-tips=Bilangan bait muatan pengguna yang disimpan
all-tbl-entrycnt-title=Jumlah Data Semua Jadual (bilangan rekod)
all-tbl-idx-pagecnt-title=Jumlah Halaman Semua Jadual dan Indeksnya
sperate-tbl-idx-pagecnt-title=Halaman Semua Jadual dan Indeks Dikira Secara Berasingan
all-tbl-idx-report-title=Semua Jadual dan Indeks
total-pages-percent-text=Peratusan daripada Jumlah Pangkalan Data
total-pages-percent-tips=Peratusan daripada Jumlah Pangkalan Data
nentry-text=Jumlah Data (bilangan rekod)
nentry-tips=Jumlah Data (bilangan rekod)
storage-text=Bait Storan Digunakan
storage-tips=Bait Storan Digunakan
compressed-size-text=Bait Digunakan Selepas Mampatan
compressed-size-tips=Bait Digunakan Selepas Mampatan
payload-text=Bait Muatan
payload-tips=Bait Muatan
total-meta-text=Bait Metadata
total-meta-tips=Bait Metadata
depth-text=Kedalaman Pepohon B
depth-tips=Kedalaman Pepohon B
avg-payload-text=Muatan Purata Setiap Rekod
avg-payload-tips=Muatan Purata Setiap Rekod
avg-unused-text=Purata Bait Tidak Digunakan Setiap Rekod
avg-unused-tips=Purata Bait Tidak Digunakan Setiap Rekod
avg-meta-text=Purata Metadata Setiap Rekod
avg-meta-tips=Purata Metadata Setiap Rekod
avg-fanout-text=Purata Bilangan Fanout
avg-fanout-tips=Purata Bilangan Fanout
gap-cnt-text=Halaman Tidak Selanjar
gap-cnt-tips=Halaman Tidak Selanjar
mx-payload-text=Muatan Maksimum Setiap Rekod
mx-payload-tips=Muatan Maksimum Setiap Rekod
ovfl-cnt-text=Jumlah Data Limpahan Digunakan
ovfl-cnt-tips=Jumlah Data Limpahan Digunakan
int-pages-text=Jumlah Halaman Indeks Digunakan
int-pages-tips=Jumlah Halaman Indeks Digunakan
leaf-pages-text=Jumlah Halaman Daun Digunakan
leaf-pages-tips=Jumlah Halaman Daun Digunakan
ovfl-pages-text=Jumlah Halaman Limpahan Digunakan
ovfl-pages-tips=Jumlah Halaman Limpahan Digunakan
total-pages-text=Jumlah Halaman Digunakan
total-pages-tips=Jumlah Halaman Digunakan
int-unused-text=Bait Tidak Digunakan pada Halaman Indeks
int-unused-tips=Bait Tidak Digunakan pada Halaman Indeks
leaf-unused-text=Bait Tidak Digunakan pada Halaman Daun
leaf-unused-tips=Bait Tidak Digunakan pada Halaman Daun
ovfl-unused-text=Bait Tidak Digunakan pada Halaman Limpahan
ovfl-unused-tips=Bait Tidak Digunakan pada Halaman Limpahan
total-unused-text=Bait Tidak Digunakan pada Semua Halaman
total-unused-tips=Bait Tidak Digunakan pada Semua Halaman
all-table-report-title=Semua Jadual (tidak termasuk indeks)
all-indices-report-title=Semua Indeks (tidak termasuk jadual)
tbl-and-all-idx-report-title=Jadual {tblName} dan Semua Indeksnya
tbl-only-report-title=Jadual {tblName} (tidak termasuk sebarang indeks)
idx-only-report-title=Semua Indeks Jadual {tblName}
tbl-report-title=Jadual {tblName}
idx-report-title=Indeks {idxName} Jadual {tblName}
props-tbl-only-report-title=Analisis Storan Jadual {tblName}
props-idx-props-only-report-title=Semua Indeks Jadual {tblName}
db-pragma-params=Parameter PRAGMA
db-quick-config-params=Pilihan Konfigurasi Pantas
select-pragma=PRAGMA
pragma-analysis-limit-tips=Menyemak atau mengubah had tetapan analisis (ANALYZE). Ini adalah anggaran bilangan baris yang diperiksa oleh arahan ANALYZE dalam setiap indeks.
pragma-application-id-tips=Digunakan untuk menyemak atau menetapkan integer 32-bit signed big-endian "Application ID" yang terletak di offset 68 dalam pengepala pangkalan data.
pragma-auto-vacuum-tips=Menyemak atau menetapkan status pengosongan automatik (auto-vacuum) dalam pangkalan data.
pragma-automatic-index-tips=Menyemak, menetapkan atau mematikan fungsi indeks automatik.
pragma-busy-timeout-tips=Menyemak atau mengubah tetapan tamat masa sibuk (busy timeout).
pragma-cache-size-tips=Menyemak atau mengubah bilangan maksimum halaman cakera pangkalan data yang dicadangkan oleh SQLite untuk disimpan dalam ingatan bagi setiap fail pangkalan data yang dibuka.
pragma-cache-spill-tips=Membolehkan atau melumpuhkan keupayaan program paging untuk melimpahkan halaman cache yang kotor ke fail pangkalan data di tengah-tengah urus niaga.
pragma-case-sensitive-like-tips=Tingkah laku lalai pengendali LIKE adalah mengabaikan huruf besar/kecil untuk aksara ASCII. Oleh itu, secara lalai, 'a' LIKE 'A' adalah benar.
pragma-cell-size-check-tips=Membolehkan atau melumpuhkan semakan kewarasan tambahan apabila membaca halaman pepohon B pangkalan data dari cakera. Apabila semakan saiz sel diaktifkan, kerosakan pangkalan data dapat dikesan lebih awal dan kurang berkemungkinan untuk "merebak".
pragma-checkpoint-fullfsync-tips=Menyemak atau mengubah tanda fullfsync untuk operasi titik semak (checkpoint). Jika tanda ini ditetapkan, kaedah penyegerakan F_FULLFSYNC akan digunakan semasa operasi titik semak pada sistem yang menyokong F_FULLFSYNC. Nilai lalai tanda CHECKPOINT_FULLFSYNC adalah OFF. Hanya Mac OS-X yang menyokong F_FULLFSYNC.
pragma-collation-list-tips=Mengembalikan senarai jujukan kolasi yang ditakrifkan untuk sambungan pangkalan data semasa.
pragma-compile-options-tips=Mengembalikan nama pilihan masa kompilasi yang digunakan semasa membina SQLite, satu pilihan setiap baris.
pragma-count-changes-tips=Menyemak atau mengubah tanda kiraan perubahan (count changes). Biasanya, apabila tanda count-changes tidak ditetapkan, penyata INSERT, UPDATE dan DELETE tidak mengembalikan data.
pragma-data-store-directory-tips=Menyemak atau mengubah nilai pembolehubah global sqlite3_data_directory, yang digunakan oleh antara muka belakang sistem pengendalian Windows untuk menentukan lokasi menyimpan fail pangkalan data yang ditentukan dengan nama laluan relatif.
pragma-data-version-tips=Menunjukkan bahawa fail pangkalan data telah diubah suai. Program interaktif yang menyimpan kandungan pangkalan data dalam ingatan atau memaparkan kandungan pangkalan data pada skrin boleh menggunakan perintah PRAGMA data_version untuk menentukan sama ada mereka perlu menyegarkan dan memuat semula ingatan atau mengemas kini paparan skrin.
pragma-default-cache-size-tips=Menyemak atau menetapkan bilangan maksimum halaman cache cakera yang dicadangkan untuk diperuntukkan bagi setiap fail pangkalan data yang dibuka.
pragma-defer-foreign-keys-tips=Mengarahkan semua kekangan kunci asing ditangguhkan sehingga urus niaga paling luar dilakukan (commit).
pragma-empty-result-callbacks-tips=Menyemak atau mengubah tanda panggil balik hasil kosong (empty result callback).
pragma-encoding-tips=Pengekodan teks yang digunakan oleh pangkalan data utama, sama ada 'UTF-8', 'UTF-16le' (pengekodan UTF-16 little-endian) atau 'UTF-16be' (pengekodan UTF-16 big-endian).
pragma-foreign-key-check-tips=Memeriksa pangkalan data atau jadual sama ada terdapat pelanggaran kekangan kunci asing.
pragma-foreign-keys-tips=Menyemak, menetapkan atau mematikan penguatkuasaan kekangan kunci asing.
pragma-freelist-count-tips=Mengembalikan bilangan halaman yang tidak digunakan dalam fail pangkalan data.
pragma-full-column-names-tips=Menyemak atau mengubah tanda full_column_names.
pragma-fullfsync-tips=Menyemak atau mengubah tanda fullfsync. Tanda ini menentukan sama ada kaedah penyegerakan F_FULLFSYNC digunakan pada sistem yang menyokongnya. Nilai lalai fullfsync adalah OFF. Hanya Mac OS X yang menyokong F_FULLFSYNC.
pragma-hard-heap-limit-tips=Mengenakan had ke atas jumlah memori timbunan (heap memory) untuk semua sambungan pangkalan data dalam satu proses.
pragma-ignore-check-constraints-tips=Membolehkan atau melumpuhkan penguatkuasaan kekangan CHECK. Tetapan lalai adalah OFF, bermakna kekangan CHECK dikuatkuasakan secara lalai.
pragma-incremental-vacuum-tips=Menyebabkan sehingga N halaman dikeluarkan daripada senarai bebas (freelist).
pragma-integrity-check-tips=Melakukan semakan pemformatan dan ketekalan peringkat rendah pada pangkalan data.
pragma-journal-mode-tips=Menyemak atau menetapkan mod jurnal (journal mode) untuk pangkalan data yang berkaitan dengan sambungan pangkalan data semasa.
pragma-journal-size-limit-tips=Mengehadkan saiz log gulung balik (rollback journal) dan fail WAL yang dikekalkan dalam sistem fail selepas urus niaga atau titik semak.
pragma-legacy-alter-table-tips=Menetapkan atau menyemak nilai tanda legacy_alter_table.
pragma-locking-mode-tips=Menetapkan atau menyemak mod penguncian (locking mode) sambungan pangkalan data. Mod penguncian adalah NORMAL atau EXCLUSIVE.
pragma-max-page-count-tips=Menyemak atau menetapkan bilangan maksimum halaman dalam fail pangkalan data.
pragma-mmap-size-tips=Menyemak atau mengubah bilangan maksimum bait yang dikhaskan untuk I/O pemetaan ingatan (memory-mapped I/O) pada satu pangkalan data.
pragma-module-list-tips=Mengembalikan senarai modul jadual maya (virtual table) yang didaftarkan dengan sambungan pangkalan data.
pragma-optimize-tips=Mencuba untuk mengoptimumkan pangkalan data.
pragma-page-count-tips=Mengembalikan jumlah bilangan halaman dalam fail pangkalan data.
pragma-page-size-tips=Menyemak atau menetapkan saiz halaman pangkalan data. Saiz halaman mestilah kuasa dua antara 512 dan 65536.
pragma-parser-trace-tips=Menghidupkan surih (trace) penganalisis sintaks SQL yang digunakan secara dalaman oleh SQLite. Berkuat kuasa apabila dikompil dengan SQLITE_DEBUG.
pragma-query-only-tips=Mencegah perubahan data pada fail pangkalan data. Apabila didayakan, sebarang percubaan CREATE, UPDATE, DROP, INSERT atau UPDATE akan menyebabkan ralat SQLITE_READONLY.
pragma-quick-check-tips=Melakukan semakan pemformatan dan ketekalan peringkat rendah pada pangkalan data, melangkau semakan ketekalan UNIQUE dan indeks.
pragma-read-uncommitted-tips=Menyemak, menetapkan atau mematikan pengasingan READ UNCOMMITTED.
pragma-recursive-triggers-tips=Menyemak, menetapkan atau mematikan fungsi rekursif pencetus.
pragma-reverse-unordered-selects-tips=Apabila didayakan, PRAGMA ini menyebabkan banyak penyata SELECT tanpa klausa ORDER BY mengeluarkan keputusan dalam susunan yang biasanya terbalik.
pragma-schema-version-tips=Mendapatkan atau menetapkan nilai integer schema_version pada offset 40 dalam pengepala pangkalan data.
pragma-secure-delete-tips=Menyemak atau mengubah tetapan padam selamat (secure-delete).
pragma-short-column-names-tips=Menyemak atau mengubah tanda nama lajur pendek (short column names).
pragma-soft-heap-limit-tips=Mengehadkan jumlah memori timbunan yang digunakan oleh semua sambungan pangkalan data dalam satu proses.
pragma-stats-tips=Mengembalikan maklumat bantuan tentang jadual dan indeks.
pragma-synchronous-tips=Menyemak atau mengubah tetapan tanda "synchronous".
pragma-temp-store-tips=Menyemak atau mengubah nilai pembolehubah global sqlite3_temp_directory, yang digunakan oleh banyak antara muka belakang sistem pengendalian untuk menentukan lokasi menyimpan jadual dan indeks sementara.
pragma-threads-tips=Bilangan benang pembantu yang dimulakan oleh penyata tersedia (prepared statement) untuk membantu pertanyaan.
pragma-trusted-schema-tips=Sama ada membenarkan fungsi SQL dan jadual maya yang tidak diaudit keselamatan dijalankan dalam skema. Menentukan sama ada paparan, pencetus atau ungkapan skema (seperti kekangan CHECK, klausa DEFAULT, lajur terhasil, indeks ungkapan dan/atau indeks separa) dibenarkan menjalankan fungsi SQL dan jadual maya yang tidak diaudit keselamatan.
pragma-user-version-tips=Mendapatkan atau menetapkan nilai integer user_version pada offset 60 dalam pengepala pangkalan data.
pragma-vdbe-addoptrace-tips=Kod operasi VDBE yang lengkap dipaparkan semasa penjanaan kod. Dengan syarat SQLite dikompil dengan pilihan SQLITE_DEBUG dan vdbe_debug diaktifkan.
pragma-vdbe-debug-tips=Menghidupkan debugging VDBE. Dengan syarat SQLite dikompil dengan pilihan SQLITE_DEBUG.
pragma-vdbe-listing-tips=Mempaparkan senarai lengkap kod operasi mesin maya pada output standard. Dengan syarat SQLite dikompil dengan pilihan SQLITE_DEBUG dan vdbe_debug diaktifkan.
pragma-vdbe-trace-tips=Mencetak kod operasi mesin maya pada output standard semasa pengiraan. Dengan syarat SQLite dikompil dengan pilihan SQLITE_DEBUG dan vdbe_debug diaktifkan.
pragma-wal-autocheckpoint-tips=Menyemak atau menetapkan selang auto-titik semak (auto-checkpoint) untuk log tulis-kehadapan (write-ahead log).
pragma-wal-checkpoint-tips=Menyebabkan kandungan dalam log tulis-kehadapan (write-ahead log) untuk pangkalan data X pada sambungan pangkalan data D dipindahkan ke fail pangkalan data, dan menetapkan semula log tulis-kehadapan.
pragma-writable-schema-tips=Membolehkan jadual sqlite_schema diubah menggunakan penyata UPDATE, INSERT dan DELETE biasa. Amaran: Penyalahgunaan pragma ini dengan mudah boleh menyebabkan kerosakan fail pangkalan data.
pragma-save-confirm=Penyata PRAGMA akan mempengaruhi operasi pangkalan data. Pastikan untuk melaksanakan penyata di bawah?
confirm-exec-text=Sah & Laksana